import React, {useRef, useCallback,useLayoutEffect, useContext, useEffect} from 'react'
import Header from './Header'
import { Swiper, SwiperSlide } from 'swiper/react';
import { observer } from 'mobx-react-lite';
// Import Swiper styles
import 'swiper/css';
import 'swiper/css/navigation';
import styles from '../Assets/css/Main.module.css'
import { Context } from '..';
const MainPage = () => {
    const {store} = useContext(Context)

    const swiperRef = useRef(0)
    
    useEffect(() => {
        console.log(store.user.accessLevel)
    }, [])

    const handleSwiperPrev = useCallback(() => {
        if (!swiperRef.current) return;
            swiperRef.current.swiper.slidePrev();
    }, []);
    
    const handleSwiperNext = useCallback(() => {
        if (!swiperRef.current) return;
            swiperRef.current.swiper.slideNext();
    }, []);

    
    return (
        store.isAuth &&
        <>
            <Header/>
            {/* <div className={styles.mobileMenu}>
                <div className={styles.container "mobile-menu--inner"}>
                    <div className={styles.mobileMenuTop}>
                        <div className={styles.mobileMenuLogo}>
                            <a href="#">
                                <img src="/assets/img/logo.png"/>
                            </a>
                        </div>
                        <div className={styles.mobileMenuClose}>
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1.16699 22.8346L22.6159 1.38573M1.16699 1.16797L22.6159 22.6169" stroke="#D30D15" strokeWidth="2.16667" strokeLinecap="round" strokeLinejoin="round"/>
                            </svg>
                        </div>
                    </div>
                    <ul>
                        <li className={styles.selected}><a href="#">Главная</a></li>
                        <li><a href="#">Мои анализы</a></li>
                        <li><a href="#">Моя история</a></li>
                        <li><a href="#">Профиль</a></li>
                        <li><a href="#">Специальные предложения</a></li>
                        <li><a href="#">Пациентам</a></li>
                        <li><a href="#">Контакты</a></li>
                        <li><a href="#">Услуги</a></li>
                        <li><a href="#">Врачи</a></li>
                    </ul>
                    <div className={styles.mobileMenuSocial}>
                        <p className={styles.mobileMenuSocialTitle}>
                            Следите за нами в соцсетях
                        </p>
                        <div className={styles.mobileMenuSocialList}>
                            <a href="#">
                                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M28.1766 11.9721C28.1846 11.9721 28.1952 11.9721 28.2058 11.9721C28.4834 11.9721 28.741 12.0584 28.9522 12.2072L28.9482 12.2045C29.1023 12.3386 29.2058 12.5272 29.2311 12.7397V12.7437C29.2576 12.9057 29.2722 13.0916 29.2722 13.2815C29.2722 13.3679 29.2696 13.4529 29.2629 13.5378V13.5259C28.9641 16.672 27.668 24.3015 27.0093 27.8234C26.7304 29.3147 26.1819 29.8141 25.6507 29.8619C24.4967 29.9695 23.6202 29.0996 22.502 28.3665C20.7517 27.2178 19.7623 26.5033 18.0637 25.3838C16.0996 24.0916 17.3732 23.3785 18.4914 22.2178C18.7849 21.9123 23.8725 17.2842 23.9721 16.8645C23.9774 16.8393 23.9801 16.8114 23.9801 16.7822C23.9801 16.6786 23.9416 16.5843 23.8792 16.5126C23.8101 16.4675 23.7238 16.4422 23.6335 16.4422C23.5737 16.4422 23.5166 16.4542 23.4635 16.4741L23.4661 16.4728C23.2908 16.5126 20.4949 18.3603 15.0784 22.0159C14.4874 22.4821 13.741 22.7769 12.9283 22.8114H12.9203C11.7689 22.672 10.7238 22.4157 9.73174 22.0505L9.83001 22.0823C8.58433 21.676 7.59495 21.4622 7.67995 20.7742C7.7251 20.4166 8.21824 20.0505 9.15936 19.676C14.9566 17.1501 18.8225 15.4852 20.757 14.6813C22.8911 13.5485 25.3652 12.6162 27.9668 12.012L28.1753 11.9708L28.1766 11.9721ZM19.9535 0C8.92829 0.0265604 0 8.97078 0 20C0 31.0452 8.95352 40 20 40C31.0465 40 40 31.0465 40 20C40 8.97078 31.0717 0.0265604 20.0491 0H20.0465C20.0155 0 19.9845 0 19.9535 0Z" fill="#D30D15"/>
                                </svg>
                            </a>
                            <a href="#">
                                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M20 0C8.95417 0 0 8.95417 0 20C0 31.0458 8.95417 40 20 40C31.0458 40 40 31.0458 40 20C40 8.95417 31.0458 0 20 0ZM27.6917 22.5646C27.6917 22.5646 29.4604 24.3104 29.8958 25.1208C29.9083 25.1375 29.9146 25.1542 29.9187 25.1625C30.0958 25.4604 30.1375 25.6917 30.05 25.8646C29.9042 26.1521 29.4042 26.2938 29.2333 26.3063H26.1083C25.8917 26.3063 25.4375 26.25 24.8875 25.8708C24.4646 25.575 24.0479 25.0896 23.6417 24.6167C23.0354 23.9125 22.5104 23.3042 21.9813 23.3042C21.914 23.3041 21.8472 23.3146 21.7833 23.3354C21.3833 23.4646 20.8708 24.0354 20.8708 25.5562C20.8708 26.0312 20.4958 26.3042 20.2313 26.3042H18.8C18.3125 26.3042 15.7729 26.1333 13.5229 23.7604C10.7687 20.8542 8.28958 15.025 8.26875 14.9708C8.1125 14.5937 8.43542 14.3917 8.7875 14.3917H11.9437C12.3646 14.3917 12.5021 14.6479 12.5979 14.875C12.7104 15.1396 13.1229 16.1917 13.8 17.375C14.8979 19.3042 15.5708 20.0875 16.1104 20.0875C16.2116 20.0863 16.311 20.0606 16.4 20.0125C17.1042 19.6208 16.9729 17.1104 16.9417 16.5896C16.9417 16.4917 16.9396 15.4667 16.5792 14.975C16.3208 14.6187 15.8812 14.4833 15.6146 14.4333C15.7225 14.2844 15.8647 14.1636 16.0292 14.0812C16.5125 13.8396 17.3833 13.8042 18.2479 13.8042H18.7292C19.6667 13.8167 19.9083 13.8771 20.2479 13.9625C20.9354 14.1271 20.95 14.5708 20.8896 16.0896C20.8708 16.5208 20.8521 17.0083 20.8521 17.5833C20.8521 17.7083 20.8458 17.8417 20.8458 17.9833C20.825 18.7562 20.8 19.6333 21.3458 19.9937C21.417 20.0384 21.4993 20.0622 21.5833 20.0625C21.7729 20.0625 22.3438 20.0625 23.8896 17.4104C24.3663 16.5568 24.7806 15.6697 25.1292 14.7562C25.1604 14.7021 25.2521 14.5354 25.3604 14.4708C25.4404 14.4301 25.529 14.4093 25.6187 14.4104H29.3292C29.7333 14.4104 30.0104 14.4708 30.0625 14.6271C30.1542 14.875 30.0458 15.6312 28.3521 17.925L27.5958 18.9229C26.0604 20.9354 26.0604 21.0375 27.6917 22.5646Z" fill="#D30D15"/>
                                </svg>
                            </a>
                        </div>
                    </div>
                </div>
            </div> */}
            <main>
                <div className={styles.content}>
                    <div className={`${styles.container} ${styles.flex}`}>
                        <div className={styles.sideBar}>
                            <ul className={styles.sideBarMenu}>
                                <li><a href="#">Главная</a></li>
                                <li><a href="#">Мои анализы</a></li>
                                <li><a href="#">Моя история</a></li>
                                <li><a href="#">Профиль</a></li>
                                <li><a href="#">Специальные предложения</a></li>
                                <li><a href="#">Пациентам</a></li>
                                <li><a href="#">Контакты</a></li>
                                <li><a href="#">Услуги</a></li>
                                <li><a href="#">Врачи</a></li>
                            </ul>
                            <div className={styles.sideBarSocial}>
                                <p className={styles.sideBarSocialTitle}>
                                    Следите за нами в соцсетях
                                </p>
                                <div className={styles.sideBarSocialList}>
                                    <a href="#">
                                        <img src="/assets/img/vk.svg"/>
                                    </a>
                                    <a href="#">
                                        <img src="/assets/img/telegram.svg"/>
                                    </a>
                                </div>
                            </div>
                            <a href="#" className={styles.buttonTelegram}>Чат-бот Telegram</a>
                        </div>
                        <div className={styles.sideContent}>
                            <div className={styles.articles}>
                                <p className={styles.blockTitle}>
                                    ДЛЯ ВАС
                                </p>
                                <Swiper
                                    ref={swiperRef}
                                    spaceBetween={12}
                                    slidesPerView={5}
                                    className="mySwiper"
                                    /* onSlideChange={() => console.log('slide change')} */
                                    /* onSwiper={(swiper) => console.log(swiper)} */
                                    >
                                    <SwiperSlide>
                                        <a href="#" className={styles.articlesItem}>
                                            <span style={{backgroundImage: "url(/assets/img/article.png)"}}  className={styles.articlesItemImage}></span>
                                            <p className={styles.articlesItemTitle}>
                                                Сезон простуд
                                            </p>
                                        </a>
                                    </SwiperSlide>
                                    <SwiperSlide>
                                        <a href="#" className={styles.articlesItem}>
                                            <span style={{backgroundImage: "url(/assets/img/article.png)"}}  className={styles.articlesItemImage}></span>
                                            <p className={styles.articlesItemTitle}>
                                                Сезон простуд
                                            </p>
                                        </a>    
                                    </SwiperSlide>
                                    <SwiperSlide>
                                        <a href="#" className={styles.articlesItem}>
                                            <span style={{backgroundImage: "url(assets/img/article.png)"}}  className={styles.articlesItemImage}></span>
                                            <p className={styles.articlesItemTitle}>
                                                Сезон простуд
                                            </p>
                                        </a>
                                    </SwiperSlide>
                                    <SwiperSlide>
                                        <a href="#" className={styles.articlesItem}>
                                            <span style={{backgroundImage: "url(assets/img/article.png)"}}  className={styles.articlesItemImage}></span>
                                            <p className={styles.articlesItemTitle}>
                                                Сезон простуд
                                            </p>
                                        </a>
                                    </SwiperSlide>
                                    <SwiperSlide>
                                        <a href="#" className={styles.articlesItem}>
                                            <span style={{backgroundImage: "url(assets/img/article.png)"}}  className={styles.articlesItemImage}></span>
                                            <p className={styles.articlesItemTitle}>
                                                Сезон простуд
                                            </p>
                                        </a>
                                    </SwiperSlide>
                                    <SwiperSlide>
                                        <a href="#" className={styles.articlesItem}>
                                            <span style={{backgroundImage: "url(assets/img/article.png)"}}  className={styles.articlesItemImage}></span>
                                            <p className={styles.articlesItemTitle}>
                                                Сезон простуд
                                            </p>
                                        </a>
                                    </SwiperSlide>
                                    <SwiperSlide>
                                        <a href="#" className={styles.articlesItem}>
                                            <span style={{backgroundImage: "url(assets/img/article.png)"}}  className={styles.articlesItemImage}></span>
                                            <p className={styles.articlesItemTitle}>
                                                Сезон простуд
                                            </p>
                                        </a>
                                    </SwiperSlide>
                                    <SwiperSlide>
                                        <a href="#" className={styles.articlesItem}>
                                            <span style={{backgroundImage: "url(assets/img/article.png)"}}  className={styles.articlesItemImage}></span>
                                            <p className={styles.articlesItemTitle}>
                                                Сезон не простуд
                                            </p>
                                        </a>
                                    </SwiperSlide>
                                </Swiper>
                                <div className={`${styles.navigationItem} ${styles.navigationPrev}`} onClick={handleSwiperPrev}>
                                    <svg width="23" height="23" viewBox="0 0 23 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <circle cx="11.5" cy="11.5" r="11.5" transform="rotate(-180 11.5 11.5)" fill="#7E7E7E"/>
                                        <path d="M14.7158 5.63439C14.3416 5.26016 13.7348 5.26016 13.3606 5.63439L8.6768 10.3228C7.92892 11.0714 7.92921 12.2845 8.67738 13.0327L13.364 17.7193C13.7382 18.0936 14.3451 18.0936 14.7193 17.7193C15.0936 17.3451 15.0936 16.7383 14.7193 16.364L10.7081 12.3528C10.3338 11.9786 10.3338 11.3717 10.7081 10.9975L14.7158 6.98966C15.0901 6.61543 15.0901 6.00871 14.7158 5.63439Z" fill="white"/>
                                    </svg>
                                </div>
                                <div className={`${styles.navigationItem} ${styles.navigationNext}`} onClick={handleSwiperNext}>
                                    <svg width="23" height="23" viewBox="0 0 23 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <circle cx="11.5" cy="11.5" r="11.5" fill="#7E7E7E"/>
                                        <path d="M8.28415 17.3656C8.65839 17.7398 9.26521 17.7398 9.63944 17.3656L14.3232 12.6772C15.0711 11.9286 15.0708 10.7155 14.3226 9.96728L9.63599 5.28069C9.26176 4.90644 8.65494 4.90644 8.28069 5.28069C7.90644 5.65494 7.90644 6.26172 8.28069 6.63598L12.2919 10.6472C12.6662 11.0214 12.6662 11.6283 12.2919 12.0025L8.28415 16.0103C7.90989 16.3846 7.90989 16.9913 8.28415 17.3656Z" fill="white"/>
                                    </svg>
                                </div>
                            </div>
                            <div className={styles.row}>
                                <div className={styles.split}>
                                    <p className={styles.blockTitle}>
                                        Мои анализы
                                    </p>
                                    <a className={`${styles.splitLink} ${styles.textRight}`} href="#">
                                        cмотреть все анализы
                                    </a>
                                </div>
                                <div className={styles.rowList}>
                                    <div className={`${styles.rowListItem} ${styles.analysis} ${styles.finish}`}>
                                        <p className={styles.date}>
                                            25.09.2023
                                        </p>
                                        <p className={styles.title}>
                                            <b>Общий анализ крови с СОЭ с ручным подсчетом лейкоцитов</b>
                                        </p>
                                        <p className={styles.pacient}>
                                            Иванова Софья
                                        </p>
                                        <a href="#" className={`${styles.status} ${styles.finish}`}>
                                            Результат
                                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path fillRule="evenodd" clipRule="evenodd" d="M19.714 6.14807L14.259 0.363037C14.07 0.164037 13.803 0 13.529 0H1.979C0.874004 0 0 1 0 2.104V9.104C0 9.656 0.437014 10 0.989014 10H0.993988C1.54699 10 2 9.656 2 9.104V3.104C2 2.552 2.427 2 2.979 2H12V6.104C12 7.209 12.874 8 13.979 8H18V9.104C18 9.656 18.437 10 18.989 10H18.994C19.547 10 20 9.656 20 9.104V6.83704C20 6.58004 19.891 6.33407 19.714 6.14807ZM3.979 15.104C3.979 14.552 3.531 14.104 2.979 14.104H1.979V16.104H2.979C3.531 16.104 3.979 15.656 3.979 15.104ZM5.97501 14.838C6.06501 16.568 4.689 18 2.979 18H2V19.104C2 19.656 1.54699 20 0.993988 20H0.989014C0.437014 20 0 19.656 0 19.104V13.104C0 12.552 0.427004 12 0.979004 12H2.80899C4.43399 12 5.89001 13.216 5.97501 14.838ZM11 15.104C11 14.552 10.531 14 9.979 14H9V18H9.979C10.531 18 11 17.656 11 17.104V15.104ZM13 15V17C13 18.65 11.65 20 10 20H7.89499C7.39999 20 7 19.599 7 19.104V12.979C7 12.438 7.438 12 7.979 12H10C11.65 12 13 13.35 13 15ZM20 13.026V13.052C20 13.604 19.531 14 18.979 14H16V16H18.979C19.531 16 20 16.473 20 17.026V17.052C20 17.604 19.531 18 18.979 18H16V19.104C16 19.656 15.547 20 14.994 20H14.989C14.437 20 14 19.656 14 19.104V13.104C14 12.552 14.427 12 14.979 12H18.979C19.531 12 20 12.473 20 13.026Z" fill="#D30D15"/>
                                            </svg>
                                        </a>
                                    </div>
                                    <div className={`${styles.rowListItem} ${styles.analysis} ${styles.finish}`}>
                                        <p className={styles.date}>
                                            05.09.2023
                                        </p>
                                        <p className={styles.title}>
                                            <b>Анализ крови на тиреотропный гормон (ТТГ), свободный тироксин (Т4) и свободный трийодтиронин (Т3 св.)</b>
                                        </p>
                                        <p className={styles.pacient}>
                                            Иванова Екатерина
                                        </p>
                                        <a href="#" className={`${styles.status} ${styles.finish}`}>
                                            Результат
                                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path fillRule="evenodd" clipRule="evenodd" d="M19.714 6.14807L14.259 0.363037C14.07 0.164037 13.803 0 13.529 0H1.979C0.874004 0 0 1 0 2.104V9.104C0 9.656 0.437014 10 0.989014 10H0.993988C1.54699 10 2 9.656 2 9.104V3.104C2 2.552 2.427 2 2.979 2H12V6.104C12 7.209 12.874 8 13.979 8H18V9.104C18 9.656 18.437 10 18.989 10H18.994C19.547 10 20 9.656 20 9.104V6.83704C20 6.58004 19.891 6.33407 19.714 6.14807ZM3.979 15.104C3.979 14.552 3.531 14.104 2.979 14.104H1.979V16.104H2.979C3.531 16.104 3.979 15.656 3.979 15.104ZM5.97501 14.838C6.06501 16.568 4.689 18 2.979 18H2V19.104C2 19.656 1.54699 20 0.993988 20H0.989014C0.437014 20 0 19.656 0 19.104V13.104C0 12.552 0.427004 12 0.979004 12H2.80899C4.43399 12 5.89001 13.216 5.97501 14.838ZM11 15.104C11 14.552 10.531 14 9.979 14H9V18H9.979C10.531 18 11 17.656 11 17.104V15.104ZM13 15V17C13 18.65 11.65 20 10 20H7.89499C7.39999 20 7 19.599 7 19.104V12.979C7 12.438 7.438 12 7.979 12H10C11.65 12 13 13.35 13 15ZM20 13.026V13.052C20 13.604 19.531 14 18.979 14H16V16H18.979C19.531 16 20 16.473 20 17.026V17.052C20 17.604 19.531 18 18.979 18H16V19.104C16 19.656 15.547 20 14.994 20H14.989C14.437 20 14 19.656 14 19.104V13.104C14 12.552 14.427 12 14.979 12H18.979C19.531 12 20 12.473 20 13.026Z" fill="#D30D15"/>
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                            </div>
                            <div className={styles.row}>
                                <div className={styles.split}>
                                    <p className={styles.blockTitle}>
                                        МОЯ ИСТОРИЯ
                                    </p>
                                    <a className={`${styles.splitLink} ${styles.textRight}`} href="#">
                                        СМОТРЕТЬ ВСЮ ИСТОРИЮ
                                    </a>
                                </div>
                                <div className={styles.rowList}>
                                    <div className={`${styles.rowListItem} ${styles.reception} ${styles.finish}`}>
                                        <p className={styles.date}>
                                            25.09.2023
                                        </p>
                                        <p className={styles.title}>
                                            <b>Детский невролог</b><br></br>
                                            Первичный приём 
                                        </p>
                                        <p className={styles.doctor}>
                                            Колбаков А.Н.
                                        </p>
                                        <p className={styles.address}>
                                            Лизюкова, 24
                                        </p>
                                        <p className={styles.pacient}>
                                            Иванова Екатерина
                                        </p>
                                        <a href="#" className={`${styles.status} ${styles.finish}`}>
                                            Заключение
                                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path fillRule="evenodd" clipRule="evenodd" d="M19.714 6.14807L14.259 0.363037C14.07 0.164037 13.803 0 13.529 0H1.979C0.874004 0 0 1 0 2.104V9.104C0 9.656 0.437014 10 0.989014 10H0.993988C1.54699 10 2 9.656 2 9.104V3.104C2 2.552 2.427 2 2.979 2H12V6.104C12 7.209 12.874 8 13.979 8H18V9.104C18 9.656 18.437 10 18.989 10H18.994C19.547 10 20 9.656 20 9.104V6.83704C20 6.58004 19.891 6.33407 19.714 6.14807ZM3.979 15.104C3.979 14.552 3.531 14.104 2.979 14.104H1.979V16.104H2.979C3.531 16.104 3.979 15.656 3.979 15.104ZM5.97501 14.838C6.06501 16.568 4.689 18 2.979 18H2V19.104C2 19.656 1.54699 20 0.993988 20H0.989014C0.437014 20 0 19.656 0 19.104V13.104C0 12.552 0.427004 12 0.979004 12H2.80899C4.43399 12 5.89001 13.216 5.97501 14.838ZM11 15.104C11 14.552 10.531 14 9.979 14H9V18H9.979C10.531 18 11 17.656 11 17.104V15.104ZM13 15V17C13 18.65 11.65 20 10 20H7.89499C7.39999 20 7 19.599 7 19.104V12.979C7 12.438 7.438 12 7.979 12H10C11.65 12 13 13.35 13 15ZM20 13.026V13.052C20 13.604 19.531 14 18.979 14H16V16H18.979C19.531 16 20 16.473 20 17.026V17.052C20 17.604 19.531 18 18.979 18H16V19.104C16 19.656 15.547 20 14.994 20H14.989C14.437 20 14 19.656 14 19.104V13.104C14 12.552 14.427 12 14.979 12H18.979C19.531 12 20 12.473 20 13.026Z" fill="#D30D15"/>
                                            </svg>
                                        </a>
                                    </div>
                                    <div className={`${styles.rowListItem} ${styles.reception} ${styles.finish}`}>
                                        <p className={styles.date}>
                                            25.09.2023
                                        </p>
                                        <p className={styles.title}>
                                            <b>Детский невролог</b><br></br>
                                            Первичный приём 
                                        </p>
                                        <p className={styles.doctor}>
                                            Колбаков А.Н.
                                        </p>
                                        <p className={styles.address}>
                                            Лизюкова, 24
                                        </p>
                                        <p className={styles.pacient}>
                                            Иванова Екатерина
                                        </p>
                                        <a href="#" className={`${styles.status} ${styles.finish}`}>
                                            Заключение
                                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path fillRule="evenodd" clipRule="evenodd" d="M19.714 6.14807L14.259 0.363037C14.07 0.164037 13.803 0 13.529 0H1.979C0.874004 0 0 1 0 2.104V9.104C0 9.656 0.437014 10 0.989014 10H0.993988C1.54699 10 2 9.656 2 9.104V3.104C2 2.552 2.427 2 2.979 2H12V6.104C12 7.209 12.874 8 13.979 8H18V9.104C18 9.656 18.437 10 18.989 10H18.994C19.547 10 20 9.656 20 9.104V6.83704C20 6.58004 19.891 6.33407 19.714 6.14807ZM3.979 15.104C3.979 14.552 3.531 14.104 2.979 14.104H1.979V16.104H2.979C3.531 16.104 3.979 15.656 3.979 15.104ZM5.97501 14.838C6.06501 16.568 4.689 18 2.979 18H2V19.104C2 19.656 1.54699 20 0.993988 20H0.989014C0.437014 20 0 19.656 0 19.104V13.104C0 12.552 0.427004 12 0.979004 12H2.80899C4.43399 12 5.89001 13.216 5.97501 14.838ZM11 15.104C11 14.552 10.531 14 9.979 14H9V18H9.979C10.531 18 11 17.656 11 17.104V15.104ZM13 15V17C13 18.65 11.65 20 10 20H7.89499C7.39999 20 7 19.599 7 19.104V12.979C7 12.438 7.438 12 7.979 12H10C11.65 12 13 13.35 13 15ZM20 13.026V13.052C20 13.604 19.531 14 18.979 14H16V16H18.979C19.531 16 20 16.473 20 17.026V17.052C20 17.604 19.531 18 18.979 18H16V19.104C16 19.656 15.547 20 14.994 20H14.989C14.437 20 14 19.656 14 19.104V13.104C14 12.552 14.427 12 14.979 12H18.979C19.531 12 20 12.473 20 13.026Z" fill="#D30D15"/>
                                            </svg>
                                        </a>
                                    </div>
                                    <div className={`${styles.rowListItem} ${styles.reception} ${styles.finish}`}>
                                        <p className={styles.date}>
                                            25.09.2023
                                        </p>
                                        <p className={styles.title}>
                                            <b>Детский невролог</b><br></br>
                                            Первичный приём 
                                        </p>
                                        <p className={styles.doctor}>
                                            Колбаков А.Н.
                                        </p>
                                        <p className={styles.address}>
                                            Лизюкова, 24
                                        </p>
                                        <p className={styles.pacient}>
                                            Иванова Екатерина
                                        </p>
                                        <a href="#" className={`${styles.status} ${styles.finish}`}>
                                            Заключение
                                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path fillRule="evenodd" clipRule="evenodd" d="M19.714 6.14807L14.259 0.363037C14.07 0.164037 13.803 0 13.529 0H1.979C0.874004 0 0 1 0 2.104V9.104C0 9.656 0.437014 10 0.989014 10H0.993988C1.54699 10 2 9.656 2 9.104V3.104C2 2.552 2.427 2 2.979 2H12V6.104C12 7.209 12.874 8 13.979 8H18V9.104C18 9.656 18.437 10 18.989 10H18.994C19.547 10 20 9.656 20 9.104V6.83704C20 6.58004 19.891 6.33407 19.714 6.14807ZM3.979 15.104C3.979 14.552 3.531 14.104 2.979 14.104H1.979V16.104H2.979C3.531 16.104 3.979 15.656 3.979 15.104ZM5.97501 14.838C6.06501 16.568 4.689 18 2.979 18H2V19.104C2 19.656 1.54699 20 0.993988 20H0.989014C0.437014 20 0 19.656 0 19.104V13.104C0 12.552 0.427004 12 0.979004 12H2.80899C4.43399 12 5.89001 13.216 5.97501 14.838ZM11 15.104C11 14.552 10.531 14 9.979 14H9V18H9.979C10.531 18 11 17.656 11 17.104V15.104ZM13 15V17C13 18.65 11.65 20 10 20H7.89499C7.39999 20 7 19.599 7 19.104V12.979C7 12.438 7.438 12 7.979 12H10C11.65 12 13 13.35 13 15ZM20 13.026V13.052C20 13.604 19.531 14 18.979 14H16V16H18.979C19.531 16 20 16.473 20 17.026V17.052C20 17.604 19.531 18 18.979 18H16V19.104C16 19.656 15.547 20 14.994 20H14.989C14.437 20 14 19.656 14 19.104V13.104C14 12.552 14.427 12 14.979 12H18.979C19.531 12 20 12.473 20 13.026Z" fill="#D30D15"/>
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </main>
            <div className={styles.bottomMenu}>
                <a href="#" className={styles.buttonPrimary}>Записаться на приём</a>
                <div className={styles.container}>
                    <div className={styles.bottomMenuList}>
                        <a href="#">
                            <span className={styles.icon}>
                                <svg width="27" height="32" viewBox="0 0 27 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M9.33333 31H2.38889C1.62183 31 1 30.2363 1 29.2941V16.3533C1 15.9009 1.14633 15.4669 1.40679 15.147L12.5179 1.49966C13.0603 0.833446 13.9397 0.833446 14.4821 1.49966L25.5932 15.147C25.8536 15.4669 26 15.9009 26 16.3533V29.2941C26 30.2363 25.3782 31 24.6111 31H17.6667M9.33333 31H17.6667M9.33333 31V20.7645C9.33333 19.8223 9.95517 19.0585 10.7222 19.0585H16.2778C17.0449 19.0585 17.6667 19.8223 17.6667 20.7645V31" stroke="#D30D15" strokeWidth="2" strokeLinejoin="round"/>
                                </svg>
                            </span>
                            Главная
                        </a>
                        <a href="#">
                            <span className={styles.icon}>
                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M29.7052 7.34167L22.6582 0.294697C22.2652 -0.0981313 21.6279 -0.0983333 21.2344 0.294697L18.8854 2.64369C18.6966 2.83247 18.5905 3.08854 18.5905 3.35551C18.5905 3.62248 18.6966 3.87854 18.8854 4.06732L19.3481 4.53005L1.26788 22.6104C0.450303 23.4278 0 24.5149 0 25.6711C0 26.8273 0.450303 27.9143 1.26788 28.732C2.08545 29.5495 3.17263 29.9999 4.32879 29.9999C5.48495 29.9999 6.57202 29.5495 7.3896 28.732L25.4699 10.6517L25.9326 11.1144C26.1215 11.3032 26.3775 11.4092 26.6444 11.4092C26.9114 11.4092 27.1676 11.3032 27.3563 11.1144L29.7053 8.7653C30.0983 8.37227 30.0983 7.7348 29.7052 7.34167ZM5.96586 27.3083C5.52859 27.7457 4.94717 27.9865 4.32879 27.9865C3.7104 27.9865 3.12889 27.7457 2.69162 27.3083C2.25424 26.8711 2.01343 26.2895 2.01343 25.6712C2.01343 25.0527 2.25424 24.4714 2.69162 24.0341L14.8993 11.8264L18.1736 15.1008L5.96586 27.3083ZM19.5973 13.6769L16.3229 10.4026L20.7718 5.95369L24.0462 9.22803L19.5973 13.6769ZM26.6443 8.97894L21.021 3.35551L21.9464 2.43015L27.5697 8.05348L26.6443 8.97894Z" fill="#D30D15"/>
                                </svg>
                            </span>
                            анализы
                        </a>
                        <a href="#">
                            <span className={styles.icon}>
                                <svg width="29" height="33" viewBox="0 0 29 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M24.1875 28.6094V30.5469C24.1875 31.0797 23.7516 31.5156 23.2188 31.5156H2.39062C1.85781 31.5156 1.42188 31.0797 1.42188 30.5469V2.45312C1.42188 1.92031 1.85781 1.48438 2.39062 1.48438H14.9359L24.1875 10.2516V22.6031" stroke="#D30D15" strokeWidth="2"/>
                                    <path d="M24.1875 10.6391H15.9531C15.4203 10.6391 14.9844 10.2031 14.9844 9.67031V1.96875" stroke="#D30D15" strokeWidth="2"/>
                                    <path d="M5.78125 9.71875H12.0781" stroke="#D30D15" strokeWidth="2"/>
                                    <path d="M5.78125 14.5625H20.7969" stroke="#D30D15" strokeWidth="2"/>
                                    <path d="M5.78125 17.9531H20.7969" stroke="#D30D15" strokeWidth="2"/>
                                    <path d="M5.78125 22.3125H16.4375" stroke="#D30D15" strokeWidth="2"/>
                                    <path d="M5.78125 25.2188H13.5312" stroke="#D30D15" strokeWidth="2"/>
                                    <path d="M23.2188 23.33C22.5406 21.8284 18.8594 21.7316 18.8594 24.3956C18.8594 26.4784 22.4437 29.1425 23.2188 29.1425C23.9938 29.1425 27.5781 26.4784 27.5781 24.3956C27.5781 21.4409 22.8313 21.6347 22.8313 24.7831" stroke="#D30D15" strokeWidth="2"/>
                                </svg>
                            </span>
                            история
                        </a>
                        <a href="#">
                            <span className={styles.icon}>
                                <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M24.5 8.7V23.5C24.5 23.7652 24.3946 24.0196 24.2071 24.2071C24.0196 24.3946 23.7652 24.5 23.5 24.5H2C1.73478 24.5 1.48043 24.3946 1.29289 24.2071C1.10536 24.0196 1 23.7652 1 23.5V2C1 1.73478 1.10536 1.48043 1.29289 1.29289C1.48043 1.10536 1.73478 1 2 1H17.57" stroke="#D30D15" strokeWidth="2"/>
                                    <path d="M6.48965 16.1358L6.16965 18.9308C6.1626 18.9931 6.16961 19.0562 6.19016 19.1155C6.21071 19.1748 6.24428 19.2287 6.28841 19.2733C6.33253 19.3179 6.38608 19.3521 6.44513 19.3733C6.50419 19.3945 6.56724 19.4021 6.62965 19.3958L9.40965 19.0758C9.50384 19.0641 9.59164 19.022 9.65965 18.9558L24.1996 4.36077C24.2769 4.28368 24.3382 4.1921 24.38 4.09129C24.4218 3.99048 24.4434 3.88241 24.4434 3.77327C24.4434 3.66413 24.4218 3.55606 24.38 3.45525C24.3382 3.35444 24.2769 3.26287 24.1996 3.18577L22.3246 1.30077C22.1681 1.14445 21.9559 1.05664 21.7347 1.05664C21.5134 1.05664 21.3012 1.14445 21.1447 1.30077L6.60465 15.8908C6.54001 15.9573 6.49953 16.0435 6.48965 16.1358Z" stroke="#D30D15" strokeWidth="2"/>
                                    <path d="M19.1855 3.26953L22.2005 6.36953" stroke="#D30D15" strokeWidth="2"/>
                                </svg>
                            </span>
                            запись на приём
                        </a>
                        <a href="#">
                            <span className={styles.icon}>
                                <svg width="29" height="29" viewBox="0 0 29 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M1.35804 16.0793C0.880654 15.0805 0.880654 13.9194 1.35804 12.9206C1.56445 12.4887 1.91642 12.0758 2.62037 11.2498C2.90054 10.921 3.04063 10.7566 3.1583 10.581C3.42804 10.1786 3.61525 9.72664 3.70908 9.25134C3.75002 9.04399 3.76719 8.8287 3.80156 8.39811C3.88789 7.31625 3.93106 6.77531 4.09046 6.32401C4.45914 5.28019 5.28019 4.45916 6.32401 4.09046C6.7753 3.93106 7.31625 3.88788 8.39812 3.80155C8.82871 3.7672 9.044 3.75002 9.25135 3.70907C9.72665 3.61524 10.1786 3.42804 10.581 3.1583C10.7566 3.04063 10.921 2.90054 11.2498 2.62037C12.0758 1.91641 12.4888 1.56444 12.9206 1.35805C13.9194 0.880651 15.0806 0.880651 16.0794 1.35805C16.5112 1.56444 16.9242 1.91641 17.7503 2.62037C18.079 2.90054 18.2434 3.04063 18.419 3.1583C18.8215 3.42804 19.2734 3.61524 19.7486 3.70907C19.9561 3.75002 20.1713 3.7672 20.602 3.80155C21.6838 3.88788 22.2247 3.93106 22.676 4.09046C23.7198 4.45916 24.5409 5.28019 24.9096 6.32401M4.09046 22.676C4.45914 23.7198 5.28019 24.5409 6.32401 24.9096C6.7753 25.069 7.31625 25.1121 8.39812 25.1985C8.82871 25.2328 9.044 25.2501 9.25135 25.2909C9.72665 25.3848 10.1786 25.5719 10.581 25.8418C10.7566 25.9594 10.921 26.0994 11.2498 26.3797C12.0758 27.0836 12.4888 27.4356 12.9206 27.642C13.9194 28.1193 15.0806 28.1193 16.0794 27.642C16.5112 27.4356 16.9242 27.0836 17.7503 26.3797C18.079 26.0994 18.2434 25.9594 18.419 25.8418C18.8215 25.5719 19.2734 25.3848 19.7486 25.2909C19.9561 25.2501 20.1713 25.2328 20.602 25.1985C21.6838 25.1121 22.2247 25.069 22.676 24.9096C23.7198 24.5409 24.5409 23.7198 24.9096 22.676C25.069 22.2247 25.1121 21.6838 25.1985 20.6019C25.2328 20.1714 25.2499 19.956 25.291 19.7487C25.3847 19.2734 25.5719 18.8214 25.8418 18.419C25.9594 18.2434 26.0995 18.079 26.3797 17.7503C27.0836 16.9242 27.4356 16.5112 27.6421 16.0793C28.1193 15.0805 28.1193 13.9194 27.6421 12.9206" stroke="#D30D15" strokeWidth="2" strokeLinecap="round"/>
                                    <path d="M10.1084 18.8952L18.8981 10.1055" stroke="#D30D15" strokeWidth="2" strokeLinecap="round"/>
                                    <path d="M19.6281 18.1622C19.6281 18.9713 18.9723 19.6272 18.1632 19.6272C17.3541 19.6272 16.6982 18.9713 16.6982 18.1622C16.6982 17.3531 17.3541 16.6973 18.1632 16.6973C18.9723 16.6973 19.6281 17.3531 19.6281 18.1622Z" fill="#D30D15"/>
                                    <path d="M12.302 10.838C12.302 11.6471 11.6461 12.3029 10.837 12.3029C10.028 12.3029 9.37207 11.6471 9.37207 10.838C9.37207 10.0289 10.028 9.37305 10.837 9.37305C11.6461 9.37305 12.302 10.0289 12.302 10.838Z" fill="#D30D15"/>
                                </svg>
                            </span>
                            акции
                        </a>
                    </div>
                </div>
            </div>
        </>
        
    )

}

export default observer(MainPage)